{
  "posts": [
    {
      "id": "m1",
      "title": "Distributed Social Media and Digital Sovereignty",
      "content": "After years on centralized platforms, I've come to appreciate Mastodon's federated approach. Digital sovereignty matters: the ability to control your own online presence without being subject to algorithm changes or arbitrary moderation decisions.\n\nFederation isn't perfect - there are challenges with discovery and reaching broad audiences. But the benefits of community governance, data portability, and resistance to monopolization make these tradeoffs worthwhile.\n\nWe should be thinking more about digital infrastructure as a commons rather than a product.",
      "date": "2024-02-15",
      "source": {
        "type": "mastodon",
        "url": "https://mastodon.social/@krisyotam/109765432100000000"
      },
      "author": "krisyotam"
    },
    {
      "id": "m2",
      "title": "Thoughts on Digital Minimalism",
      "content": "I've been experimenting with digital minimalism for the past month. Some observations:\n\n1. Most notifications add no value and create anxiety\n2. 95% of my phone use consists of the same 5 apps\n3. Time-boxing social media to 30 min/day drastically improves focus\n4. Physical books > e-books for retention and enjoyment\n5. Low-tech solutions often outperform high-tech ones\n\nThe goal isn't to reject technology, but to be intentional about what tools serve your values rather than letting tools dictate your behavior.",
      "date": "2024-03-21",
      "source": {
        "type": "mastodon",
        "url": "https://mastodon.social/@krisyotam/109876543210000000"
      },
      "author": "krisyotam"
    },
    {
      "id": "m3",
      "title": "Ideas on open-source knowledge management",
      "context": {
        "type": "question",
        "author": "tech_gardener",
        "content": "Looking for suggestions on open-source knowledge management systems. Currently using a mix of Logseq, Obsidian, and plain text files, but feeling some friction between them. Anyone found a good workflow for research notes, daily journaling, and project management together?"
      },
      "conversation": [
        {
          "author": "systemist",
          "content": "I've settled on Obsidian for everything. With the right plugins, it can handle task management (Kanban, tasks plugins), journaling (templates, calendar), and research (dataview, citations). The real advantage is keeping everything in plain markdown - future-proof and portable.",
          "date": "2024-04-10"
        },
        {
          "author": "krisyotam",
          "content": "I've experimented with many systems and ultimately believe that principles matter more than tools. That said, here's what's working for me:\n\n1. **Separate tools for separate functions**: I use Obsidian for permanent notes and knowledge graphs, a simple outliner for daily/scratch notes, and a dedicated task system for projects.\n\n2. **Simple formats and clear boundaries**: Plain text/markdown for everything, with a consistent linking convention between systems.\n\n3. **Manual curation > automatic organization**: Spend time deliberately processing notes rather than assuming automation will organize your thinking.\n\n4. **Regular review cycles**: Weekly for projects, monthly for knowledge management.\n\nThe key insight that improved my workflow: recognize the difference between capturing (which should be frictionless) and processing (which should be deliberate). Many systems try to do both and end up serving neither purpose well.\n\nI'd also suggest looking at Zettlr if you want something more academically oriented, or Dendron if you're comfortable with VS Code.",
          "date": "2024-04-10"
        },
        {
          "author": "tech_gardener",
          "content": "Thanks both. @krisyotam I like your point about separating capture from processing - that might be where I'm getting stuck. Do you have a specific routine for turning your quick notes into more permanent knowledge?",
          "date": "2024-04-11"
        },
        {
          "author": "krisyotam",
          "content": "Yes, I have a specific process:\n\n1. **Daily capture**: Throughout the day, I collect thoughts, quotes, and ideas in a simple outliner without worrying about organization.\n\n2. **Processing session**: 2-3 times weekly, I review these notes and ask: \"Is this worth keeping?\"\n   - If no: Delete\n   - If yes: Convert to a permanent note\n\n3. **Permanent note creation**:\n   - Give it a clear title that represents the main idea\n   - Rewrite in my own words (crucial for understanding)\n   - Add metadata (tags, sources, related concepts)\n   - Link to existing notes\n\n4. **Monthly review**: I look at recent additions to my knowledge base, identify patterns, and update my index notes that serve as entry points to various topics.\n\nThis separation prevents my permanent knowledge base from becoming cluttered with half-formed thoughts while still capturing everything potentially valuable.\n\nAnother tip: maintain an \"inbox zero\" mentality with your daily notes - they should be processed or discarded, not left to accumulate indefinitely.",
          "date": "2024-04-11"
        }
      ],
      "date": "2024-04-11",
      "source": {
        "type": "mastodon",
        "url": "https://fosstodon.org/@tech_gardener/110198765432100000"
      },
      "author": "krisyotam"
    }
  ]
} 