{
  "quotes": [
    {
      "text": "I am in a charming state of confusion",
      "author": "Ada Lovelace"
    },
    {
      "text": "the question has not settled as to if madness is the loftiest intelligence",
      "author": "Edgar Allen Poe"
    },
    {
      "text": "Oh, you can't help that,” said the Cat: “we're all mad here.",
      "author": "Lewis Caroll"
    },
    {
      "text": "Why, sometimes I've believed as many as six impossible things before breakfast.",
      "author": "Lewis Caroll"
    },
    {
      "text": "Who in the world am I? Ah, that's the great puzzle.",
      "author": "Lewis Caroll"
    },
    {
      "text": "Curiouser and curiouser!",
      "author": "Lewis Caroll"
    },
    {
      "text": "\"I don't think...\" then you shouldn't talk, said the Hatter.",
      "author": "Lewis Carroll"
    },
    {
      "text": "The question has not yet settled as to whether madness is or is not the loftiest intelligence",
      "author": "Edgar Allen Poe"
    },
    {
      "text": "I'm afraid I can't explain myself, sir. Because I am not myself, you see?",
      "author": "Lewis Caroll"
    },
    {
      "text": "If you don't know where you are going any road can take you there",
      "author": "Lewis Caroll"
    },
    {
      "text": "“Well, I never heard it before, but it sounds uncommon nonsense.”",
      "author": "Lewis Caroll"
    },
    {
      "text": "Yes, that's it! Said the Hatter with a sigh, it's always tea time.",
      "author": "Lewis Caroll"
    },
    {
      "text": "It would be so nice if something made sense for a change.",
      "author": "Lewis Caroll"
    },
    {
      "text": "No wise fish would go anywhere without a porpoise.",
      "author": "Lewis Caroll"
    },
    {
      "text": "If you lay down with dogs, you get up with fleas.",
      "author": "Mozzie, White Collar"
    },
    {
      "text": "Realists don't fear the results of their study.",
      "author": "Fyodor Dostoevsky"
    },
    {
      "text": "His heart is a suspended lute; As soon as you touch it, it resonates.",
      "author": "Edgar Allen Poe"
    },
    {
      "text": "The only way to do great work is to love what you do",
      "author": "Steve Jobs"
    },
    {
      "text": "Simplicity is the ultimate sophistication",
      "author": "Leonardo da Vinci"
    },
    {
      "text": "The future belongs to those who believe in the beauty of their dreams",
      "author": "Eleanor Roosevelt"
    },
    {
      "text": "Innovation distinguishes between a leader and a follower",
      "author": "Steve Jobs"
    },
    {
      "text": "May you live in interesting times.",
      "author": "Chinese Proverb"
    },
    {
      "text": "May you find what you are looking for.",
      "author": "Chinese Proverb"
    },
    {
      "text": "May you get more than you bargained for.",
      "author": "Chinese Proverb"
    },
    {
      "text": "Paranoia is a skill, the secret to longevity.",
      "author": "Mozzie, White Collar"
    },
    {
      "text": "We feel free when we escape, even if it be but from the frying pan into the fire.",
      "author": "Eric Hoffer"
    },
    {
      "text": "There are many things of which a wise man might wish to be ignorant.",
      "author": "Ralph W Emerson"
    },
    {
      "text": "It's goodbye, but we lean forward to the next crazy venture beneath the skies.",
      "author": "Jack Kerouac"
    },
    {
      "text": "You’re a collection of impeccable, elaborate masks in orbit of a stunted heart.",
      "author": "Verna, House of Usher"
    },
    {
      "text": "The reason for time is so that everything doesn't happen at once.",
      "author": "Albert Einstein"
    },
    {
      "text": "Great Spirits have often encountered violent opposition from weaker minds.",
      "author": "Albert Einstein"
    },
    {
      "text": "Bureaucracy has a vestes interest in creating the chaos in which they exist.",
      "author": "Richard Nixon"
    },
    {
      "text": "language in its highest expression is musical",
      "author": "Verna, House of Usher"
    },
    {
      "text": "If you know the enemy and know yourself, you need not fear the result of a hundred battles.",
      "author": "Sun Tzu"
    },
    {
      "text": "A wise man once said, it's fun to do the impossible.",
      "author": "Walt Disney"
    },
    {
      "text": "Love is a temporary madness. It erupts like an earthquake and then subsides.",
      "author": "Louis de Bernières"
    },
    {
      "text": "Perfection is the antithesis of authenticity.",
      "author": "Mozzie, White Collar"
    },
    {
      "text": "A careless word may kindle strife",
      "author": "Unknown"
    },
    {
      "text": "A cruel word may wreck a life",
      "author": "Unknown"
    },
    {
      "text": "A timely word may lessen stress",
      "author": "Unknown"
    },
    {
      "text": "A loving word may heal and bless",
      "author": "Unknown"
    },
    {
      "text": "A bitter word may hate instill,",
      "author": "T.J. Bach"
    },
    {
      "text": "A brutal word may smite and kill",
      "author": "T.J. Bach"
    },
    {
      "text": "Flame is a fickle mistress.",
      "author": "Mozzie, White Collar"
    },
    {
      "text": "Everything good must one day come to an end.",
      "author": "Mozzie, White Collar"
    },
    {
      "text": "Sacred cows make the best hamburger.",
      "author": "Mark Twain"
    },
    {
      "text": "Without leaps of imagination, you lose the excitement of possibility.",
      "author": "Gloria Steinem"
    },
    {
      "text": "Behind every worst-case scenario, there's a worse worst-case scenario.",
      "author": "Mozzie, White Collar"
    },
    {
      "text": "He who conquers himself is the mightiest warrior.",
      "author": "Confucius"
    },
    {
      "text": "True knowledge exists in knowing that you know nothing.",
      "author": "Socrates"
    },
    {
      "text": "Fear gives intelligence even to fools.",
      "author": "Unknown"
    },
    {
      "text": "Everyone you will ever meet knows something you don't.",
      "author": "Bill Nye"
    },
    {
      "text": "Give a man a mask and he'll show you his true face.",
      "author": "Oscar Wilde"
    },
    {
      "text": "Most of us know how to say nothing; few of us know when.",
      "author": "Unknown"
    },
    {
      "text": "The easy way to teach children the value of money is to borrow from them.",
      "author": "Unknown"
    },
    {
      "text": "No individual raindrop ever considers itself responsible for the flood.",
      "author": "Unknown"
    },
    {
      "text": "Time heals almost everything.",
      "author": "Unknown"
    },
    {
      "text": "Those who don't believe in magic will never find it.",
      "author": "Roald Dahl"
    },
    {
      "text": "Let not your heart be troubled.",
      "author": "John 14:1a"
    },
    {
      "text": "In the multitude of counsellors there is safety.",
      "author": "Proverbs 11:14"
    },
    {
      "text": "He that troubles his own house shall inherit the wind.",
      "author": "Proverbs 11:29"
    },
    {
      "text": "If you can't stand the heat, get out of the kitchen.",
      "author": "Harry S. Truman"
    },
    {
      "text": "It is better to try and fail than fail to try.",
      "author": "Unknown"
    },
    {
      "text": "A journey of a thousand li starts with one step.",
      "author": "Chinese Proverb"
    },
    {
      "text": "People don't buy what you do; they buy why you do it.",
      "author": "Simon Sinek"
    },
    {
      "text": "A smooth sea never made a skilled sailor.",
      "author": "Franklin D. Roosevelt"
    },
    {
      "text": "A ship in harbor is safe, but that is not what ships are built for.",
      "author": "John A. Shedd"
    },
    {
      "text": "Never half-ass two things, whole-ass one thing.",
      "author": "Ron Swanson"
    },
    {
      "text": "Vulgarity is no substitute for wit.",
      "author": "Violet Crawley"
    },
    {
      "text": "I think, therefore I am.",
      "author": "René Descartes"
    },
    {
      "text": "Injustice anywhere is a threat to justice everywhere.",
      "author": "Martin Luther King Jr."
    },
    {
      "text": "What we think, we become.",
      "author": "Buddha"
    },
    {
      "text": "Happiness depends upon ourselves.",
      "author": "Aristotle"
    },
    {
      "text": "He who has a why to live can bear almost any how.",
      "author": "Friedrich Nietzsche"
    },
    {
      "text": "The greatest wealth is to live content with little.",
      "author": "Plato"
    },
    {
      "text": "It is not length of life, but depth of life.",
      "author": "Ralph Waldo Emerson"
    },
    {
      "text": "Knowing others is intelligence; knowing yourself is true wisdom.",
      "author": "Lao Tzu"
    },
    {
      "text": "Life is what happens when you’re busy making other plans.",
      "author": "John Lennon"
    },
    {
      "text": "You must be the change you wish to see in the world.",
      "author": "Mahatma Gandhi"
    },
    {
      "text": "Time is a great teacher, but unfortunately it kills all its pupils.",
      "author": "Louis Hector Berlioz"
    },
    {
      "text": "The mind is everything. What you think you become.",
      "author": "Buddha"
    },
    {
      "text": "The unexamined life is not worth living.",
      "author": "Socrates"
    },
    {
      "text": "The fear of the Lord is the beginning of wisdom.",
      "author": "Proverbs 9:10"
    },
    {
      "text": "I can do all things through him who strengthens me.",
      "author": "Philippians 4:13"
    },
    {
      "text": "The Lord is my shepherd; I shall not want.",
      "author": "Psalm 23:1"
    },
    {
      "text": "And you will know the truth, and the truth will set you free.",
      "author": "John 8:32"
    },
    {
      "text": "Love is patient, love is kind.",
      "author": "1 Corinthians 13:4"
    },
    {
      "text": "Be still, and know that I am God.",
      "author": "Psalm 46:10"
    },
    {
      "text": "For where your treasure is, there your heart will be also.",
      "author": "Matthew 6:21"
    },
    {
      "text": "For we walk by faith, not by sight.",
      "author": "2 Corinthians 5:7"
    },
    {
      "text": "Prove all things; hold fast that which is good.",
      "author": "1 Thessalonians 5:21"
    },
    {
      "text": "Let God be true, but every man a liar.",
      "author": "Romans 3:4"
    },
    {
      "text": "Wherefore rebuke them sharply, that they may be sound in the faith.",
      "author": "Titus 1:13"
    },
    {
      "text": "Live people ignore the strange and unusual, I myself am strange and unusual",
      "author": "Lydia Deetz"
    },
    {
      "text": "Veronica you look like hell. Yeh? I just got back",
      "author": "Veronica Sawyer"
    },
    {
      "text": "How am I supposed to recover when I don't even understand my disease?",
      "author": "Susanna Kaysen"
    },    {
      "text": "Everything that makes your heart beat faster is beautiful",
      "author": "Thomas Andre"
    },
    {
      "text": "How am I supposed to recover when I don't even understand my disease?",
      "author": "Susanna Kaysen"
    },
    {
      "text": "How am I supposed to recover when I don't even understand my disease?",
      "author": "Susanna Kaysen"
    },
    {
      "text": "What is imagination?... It is a God-like, a noble faculty. It renders earth tolerable, it teaches us to live, in the tone of the eternal.",
      "author": "Ada Lovelace"
    },
    {
      "text": "If you can't give me poetry, can't you give me \"poetical science\"?",
      "author": "Ada Lovelace"
    },
    {
      "text": "I don't wish to be without my brains, tho' they doubtless interfere with a blind faith which would be very comfortable.",
      "author": "Ada Lovelace"
    },
    {
      "text": "I never am really satisfied that I understand anything; because, understand it well as I may, my comprehension can only be an infinitesimal fraction of all I want to understand about the many connections and relations which occur to me, how the matter in question was first thought of or arrived at, etc., etc.",
      "author": "Ada Lovelace"
    },
    {
      "text": "Why, sometimes I've believed as many as six impossible things before breakfast.",
      "author": "Alice"
    },
    {
      "text": "If I had a world of my own, everything would be nonsense. Nothing would be what it is, because everything would be what it isn't. And contrary wise, what is, it wouldn't be. And what it wouldn't be, it would. You see?",
      "author": "Alice"
    },
    {
      "text": "Who in the world am I? Ah, that's the great puzzle.",
      "author": "Alice"
    },
    {
      "text": "Curiouser and curiouser!",
      "author": "Alice"
    },
    {
      "text": "If everybody minded their own business, the world would go around a great deal faster than it does.",
      "author": "The Duchess"
    },
    {
      "text": "Alice: How long is forever? White Rabbit: Sometimes, just one second.",
      "author": "White Rabbit"
    },
    {
      "text": "Contrariwise,' continued Tweedledee, 'if it was so, it might be; and if it were so, it would be; but as it isn't, it ain't. That's logic.",
      "author": "Tweedledee"
    },
    {
      "text": "I knew who I was this morning, but I've changed a few times since then.",
      "author": "Alice"
    },
    {
      "text": "\"Where should I go?\" - Alice. \"That depends on where you want to end up.\"",
      "author": "The Cheshire Cat"
    },
    {
      "text": "Alice asked the Cheshire Cat, who was sitting in a tree, “What road do I take?” The cat asked, “Where do you want to go?” “I don’t know,” Alice answered. “Then,” said the cat, “it really doesn’t matter, does it?”",
      "author": "The Cheshire Cat"
    },
    {
      "text": "How long is forever? Sometimes just one second",
      "author": "White Rabbit"
    },
    {
      "text": "You're mad, bonkers, completely off your head. But I'll tell you a secret. All the best people are.",
      "author": "The Mad Hatter"
    },
    {
      "text": "Sometimes the only way to stay sane is to go a little crazy.",
      "author": "Susanna Kaysen"
    },
    {
      "text": "Was insanity just a matter of dropping the act?",
      "author": "Susanna Kaysen"
    },
    {
      "text": "When you’re sad you need to hear your sorrow structured into sound.",
      "author": "Susanna Kaysen"
    },
    {
      "text": "As far as I could see, life demanded skills I didn't have.",
      "author": "Susanna Kaysen"
    },
    {
      "text": "Every window in Alcatraz has a view of San Francisco.",
      "author": "Susanna Kaysen"
    },
    {
      "text": "I was trying to explain my situation to myself. My situation was that I was in pain and nobody knew it, even I had trouble knowing it. So I told myself, over and over, You are in pain. It was the only way I could get through to myself. I was demonstrating externally and irrefutably an inward condition.",
      "author": "Susanna Kaysen"
    },
    {
      "text": "With wild eyes that had seen freedom.",
      "author": "Susanna Kaysen"
    },
    {
      "text": "When I was supposed to be awake, I was asleep. When I was supposed to sleep, I was silent. When a pleasure offered itself to me, I avoided it.",
      "author": "Susanna Kaysen"
    },
    {
      "text": "There is thought, and then there is thinking about thoughts, and they don't feel the same.",
      "author": "Susanna Kaysen"
    },
    {
      "text": "My family had a lot of characteristics - achievements, ambitions, talents, expectations - that all seemed to be recessive in me.",
      "author": "Susanna Kaysen"
    },
    {
      "text": "Two roads diverged in a wood, and I— I took the one less traveled by, And that has made all the difference.",
      "author": "Robert Frost"
    },
    {
      "text": "They were deliberating amongst themselves as to how they could give wings to death so that it could, in a moment, penetrate everywhere, both near and far.",
      "author": "Bishop John Amos Comenius"
    },
    {
      "text": "Glory isn't that simple",
      "author": "Ye Xiu"
    },
    {
      "text": "People see me and think I'm weak. They want to take care of me. But I can take care of myself, by myself.",
      "author": "Toph Beifong"
    },
    {
      "text": "I am the greatest earthbender in the world! Don't you two dunderheads ever forget it!",
      "author": "Toph Beifong"
    },
    {
      "text": "The ruling elite have been carrying out secret nuclear war for the purpose of depopulation since World War II under the guise of atmospheric testing 'for the national security,' nuclear power 'too cheap to meter' and depleted uranium 'kinetic energy' bullets",
      "author": "Leuren Moret"
    },
    {
      "text": "The world is full of kings and queens, who blind your eyes and steal your dreams.",
      "author": "Leuren Moret"
    },
    {
      "text": "Signs and symbols rule the world, not words nor laws.",
      "author": "Confucious"
    },
    {
      "text": "I foolishly once believed the myth that  nuclear energy is clean & safe. That myth has completely broken down. Restarting nuclear reactors while we still have no place to dispose of nuclear waste is a criminal act toward future generations.",
      "author": "Morihiro Hosokawa"
    },
    {
      "text": "The public is wonderfully tolerant. It forgives everything except genius.",
      "author": "Oscar Wilde"
    },
    {
      "text": "No great artist ever sees things as they really are. If he did, he would cease to be an artist.",
      "author": "Oscar Wilde"
    },
    {
      "text": "Those who were seen dancing were thought to be insane by those who could not hear the music.",
      "author": "Friedrich Nietzsche"
    },
    {
      "text": "Talent hits a target no one else can hit; Genius hits a target no one else can see.",
      "author": "Arthur Schopenhauer"
    },
    {
      "text": "Only those who will risk going too far can possibly find out how far one can go.",
      "author": "T. S. Eliot"
    },
    {
      "text": "The real voyage of discovery consists not in seeking new landscapes, but in having new eyes.",
      "author": "Marcel Proust"
    },
    {
      "text": "A book must be the axe for the frozen sea within us.",
      "author": "Franz Kafka"
    },
    {
      "text": "It is the mark of an educated mind to be able to entertain a thought without accepting it.",
      "author": "Aristotle"
    },
    {
      "text": "Elegance is a physical quality… If a woman doesn’t have it naked, she’ll never have it clothed.",
      "author": "Jean Cocteau"
    },
    {
      "text": "Genius is nothing but childhood recovered at will.",
      "author": "Charles Baudelaire"
    }
  ]
}

