[
  {
    "id": "1",
    "title": "The Road Not Taken",
    "dateCreated": "1916-08-18",
    "year": 1916,
    "type": "Narrative Poem",
    "collection": "Mountain Interval",
    "description": "Written as a gentle mockery of indecision, particularly the indecision that Robert Frost felt in his friend Edward Thomas.",
    "slug": "the-road-not-taken",
    "image": "/images/poetry/road-not-taken.jpg",
    "stanza1": "Two roads diverged in a yellow wood,\nAnd sorry I could not travel both\nAnd be one traveler, long I stood\nAnd looked down one as far as I could\nTo where it bent in the undergrowth;",
    "stanza2": "Then took the other, as just as fair,\nAnd having perhaps the better claim,\nBecause it was grassy and wanted wear;\nThough as for that the passing there\nHad worn them really about the same,",
    "stanza3": "And both that morning equally lay\nIn leaves no step had trodden black.\nOh, I kept the first for another day!\nYet knowing how way leads on to way,\nI doubted if I should ever come back.",
    "stanza4": "I shall be telling this with a sigh\nSomewhere ages and ages hence:\nTwo roads diverged in a wood, and I—\nI took the one less traveled by,\nAnd that has made all the difference."
  },
  {
    "id": "2",
    "title": "Holy Shift",
    "dateCreated": "2023-05-15",
    "year": 2023,
    "type": "Lyric Poem",
    "collection": "Modern Reflections",
    "description": "A contemporary exploration of sudden paradigm shifts in personal perspective.",
    "slug": "holy-shift",
    "image": "/images/poetry/holy-shift.jpg",
    "stanza1": "In the quiet of the night, when shadows dance,\nI find myself in a peculiar trance.\nThe world has shifted, rearranged its face,\nAnd I'm left wondering about my place.",
    "stanza2": "Holy shift, the ground beneath my feet\nIs not the same as yesterday's concrete.\nThe stars above have changed their ancient light,\nAnd truth itself has vanished from my sight.",
    "stanza3": "What once was certain now dissolves like mist,\nThe solid facts I'd sworn by don't exist.\nThe paradigms I built my life around\nHave crumbled silently without a sound.",
    "stanza4": "Holy shift, the maps I used to read\nNo longer show the paths that I should tread.\nThe compass spins in circles, lost and wild,\nAnd I am standing here, confused, beguiled.",
    "stanza5": "But in this chaos, something new emerges,\nA freedom from the old, constraining urges.\nWhen certainty dissolves, possibility blooms,\nAnd from destruction, new creation looms.",
    "stanza6": "Holy shift, I see with fresh-born eyes\nThe beauty in uncertainty that lies.\nPerhaps it's not about the solid ground,\nBut learning how to dance when none is found.",
    "stanza7": "So I embrace this holy, sacred shift,\nAnd treat my disorientation as a gift.\nFor only when the known has fallen through,\nCan we discover what is truly new."
  },
  {
    "id": "3",
    "title": "Hope is the thing with feathers",
    "dateCreated": "1861-01-01",
    "year": 1861,
    "type": "Lyric Poem",
    "collection": "Poems by Emily Dickinson",
    "description": "A metaphorical poem that likens hope to a bird that continues to sing despite difficult circumstances.",
    "slug": "hope-is-the-thing-with-feathers",
    "image": "/images/poetry/hope-feathers.jpg",
    "stanza1": "Hope is the thing with feathers\nThat perches in the soul,\nAnd sings the tune without the words,\nAnd never stops at all,",
    "stanza2": "And sweetest in the gale is heard;\nAnd sore must be the storm\nThat could abash the little bird\nThat kept so many warm.",
    "stanza3": "I've heard it in the chillest land,\nAnd on the strangest sea;\nYet, never, in extremity,\nIt asked a crumb of me."
  },
  {
    "id": "4",
    "title": "Do Not Go Gentle Into That Good Night",
    "dateCreated": "1947-01-01",
    "year": 1947,
    "type": "Villanelle",
    "description": "Written for Dylan Thomas's dying father, encouraging him to fight against death.",
    "slug": "do-not-go-gentle-into-that-good-night",
    "image": "/images/poetry/do-not-go-gentle.jpg",
    "stanza1": "Do not go gentle into that good night,\nOld age should burn and rave at close of day;\nRage, rage against the dying of the light.",
    "stanza2": "Though wise men at their end know dark is right,\nBecause their words had forked no lightning they\nDo not go gentle into that good night.",
    "stanza3": "Good men, the last wave by, crying how bright\nTheir frail deeds might have danced in a green bay,\nRage, rage against the dying of the light.",
    "stanza4": "Wild men who caught and sang the sun in flight,\nAnd learn, too late, they grieved it on its way,\nDo not go gentle into that good night.",
    "stanza5": "Grave men, near death, who see with blinding sight\nBlind eyes could blaze like meteors and be gay,\nRage, rage against the dying of the light.",
    "stanza6": "And you, my father, there on the sad height,\nCurse, bless, me now with your fierce tears, I pray.\nDo not go gentle into that good night.\nRage, rage against the dying of the light."
  },
  {
    "id": "5",
    "title": "Sonnet 18",
    "dateCreated": "1609-01-01",
    "year": 1609,
    "type": "Sonnet",
    "collection": "Shakespeare's Sonnets",
    "slug": "sonnet-18",
    "image": "/images/poetry/sonnet-18.jpg",
    "stanza1": "Shall I compare thee to a summer's day?\nThou art more lovely and more temperate:\nRough winds do shake the darling buds of May,\nAnd summer's lease hath all too short a date;",
    "stanza2": "Sometime too hot the eye of heaven shines,\nAnd often is his gold complexion dimm'd;\nAnd every fair from fair sometime declines,\nBy chance or nature's changing course untrimm'd;",
    "stanza3": "But thy eternal summer shall not fade,\nNor lose possession of that fair thou ow'st;\nNor shall death brag thou wander'st in his shade,\nWhen in eternal lines to time thou grow'st:",
    "stanza4": "So long as men can breathe or eyes can see,\nSo long lives this, and this gives life to thee."
  },
  {
    "id": "6",
    "title": "The Waste Land",
    "dateCreated": "1922-01-01",
    "year": 1922,
    "type": "Modernist Poem",
    "collection": "The Waste Land and Other Poems",
    "description": "T.S. Eliot's landmark modernist poem depicting the disillusionment and despair of the post-World War I generation.",
    "slug": "the-waste-land",
    "image": "/images/poetry/waste-land.jpg",
    "stanza1": "April is the cruellest month, breeding\nLilacs out of the dead land, mixing\nMemory and desire, stirring\nDull roots with spring rain.",
    "stanza2": "Winter kept us warm, covering\nEarth in forgetful snow, feeding\nA little life with dried tubers.",
    "stanza3": "Summer surprised us, coming over the Starnbergersee\nWith a shower of rain; we stopped in the colonnade,\nAnd went on in sunlight, into the Hofgarten,\nAnd drank coffee, and talked for an hour."
  },
  {
    "id": "7",
    "title": "Stopping by Woods on a Snowy Evening",
    "dateCreated": "1923-01-01",
    "year": 1923,
    "type": "Lyric Poem",
    "collection": "New Hampshire",
    "description": "A contemplative poem about pausing to appreciate beauty while acknowledging responsibilities.",
    "slug": "stopping-by-woods-on-a-snowy-evening",
    "image": "/images/poetry/snowy-evening.jpg",
    "stanza1": "Whose woods these are I think I know.\nHis house is in the village though;\nHe will not see me stopping here\nTo watch his woods fill up with snow.",
    "stanza2": "My little horse must think it queer\nTo stop without a farmhouse near\nBetween the woods and frozen lake\nThe darkest evening of the year.",
    "stanza3": "He gives his harness bells a shake\nTo ask if there is some mistake.\nThe only other sound's the sweep\nOf easy wind and downy flake.",
    "stanza4": "The woods are lovely, dark and deep,\nBut I have promises to keep,\nAnd miles to go before I sleep,\nAnd miles to go before I sleep."
  },
  {
    "id": "8",
    "title": "The Raven",
    "dateCreated": "1845-01-29",
    "year": 1845,
    "type": "Narrative Poem",
    "collection": "The Raven and Other Poems",
    "description": "A narrative poem about a talking raven's mysterious visit to a distraught lover, reflecting on grief and loss.",
    "slug": "the-raven",
    "image": "/images/poetry/raven.jpg",
    "stanza1": "Once upon a midnight dreary, while I pondered, weak and weary,\nOver many a quaint and curious volume of forgotten lore—\nWhile I nodded, nearly napping, suddenly there came a tapping,\nAs of someone gently rapping, rapping at my chamber door.\n\"'Tis some visitor,\" I muttered, \"tapping at my chamber door—\nOnly this and nothing more.\"",
    "stanza2": "Ah, distinctly I remember it was in the bleak December;\nAnd each separate dying ember wrought its ghost upon the floor.\nEagerly I wished the morrow;—vainly I had sought to borrow\nFrom my books surcease of sorrow—sorrow for the lost Lenore—\nFor the rare and radiant maiden whom the angels name Lenore—\nNameless here for evermore.",
    "stanza3": "And the silken, sad, uncertain rustling of each purple curtain\nThrilled me—filled me with fantastic terrors never felt before;\nSo that now, to still the beating of my heart, I stood repeating\n\"'Tis some visitor entreating entrance at my chamber door—\nSome late visitor entreating entrance at my chamber door;—\nThis it is and nothing more.\"",
    "stanza4": "Presently my soul grew stronger; hesitating then no longer,\n\"Sir,\" said I, \"or Madam, truly your forgiveness I implore;\nBut the fact is I was napping, and so gently you came rapping,\nAnd so faintly you came tapping, tapping at my chamber door,\nThat I scarce was sure I heard you\"—here I opened wide the door;—\nDarkness there and nothing more."
  },
  {
    "id": "9",
    "title": "Ozymandias",
    "dateCreated": "1818-01-01",
    "year": 1818,
    "type": "Sonnet",
    "description": "A sonnet about the inevitable decline of leaders and their empires over time.",
    "slug": "ozymandias",
    "image": "/images/poetry/ozymandias.jpg",
    "stanza1": "I met a traveller from an antique land,\nWho said—\"Two vast and trunkless legs of stone\nStand in the desert. . . . Near them, on the sand,\nHalf sunk a shattered visage lies, whose frown,\nAnd wrinkled lip, and sneer of cold command,\nTell that its sculptor well those passions read\nWhich yet survive, stamped on these lifeless things,\nThe hand that mocked them, and the heart that fed;",
    "stanza2": "And on the pedestal, these words appear:\nMy name is Ozymandias, King of Kings;\nLook on my Works, ye Mighty, and despair!\nNothing beside remains. Round the decay\nOf that colossal Wreck, boundless and bare\nThe lone and level sands stretch far away.\""
  },
  {
    "id": "10",
    "title": "Rational Motherhood",
    "dateCreated": "2025-03-15",
    "year": 2025,
    "type": "Free Verse",
    "collection": "Future Reflections",
    "description": "A meditation on the balance between logic and emotion in parenting.",
    "slug": "rational-motherhood",
    "image": "/images/poetry/rational-motherhood.jpg",
    "stanza1": "I calculate the hours of sleep I've lost,\nDivide them by the moments of pure joy,\nSubtract the weight of worry, add the cost\nOf raising you, my darling girl and boy.",
    "stanza2": "The equation never balances, I find,\nFor love defies the laws of mathematics.\nNo formula exists that can define\nThe way your laughter shatters all my tactics.",
    "stanza3": "I planned it all with spreadsheets, charts, and books,\nA rational approach to motherhood.\nBut chaos theory governs how it looks\nWhen theory meets reality—understood",
    "stanza4": "Only when I surrendered to the mess,\nThe beautiful disorder of our days.\nThe sticky fingerprints that now express\nMore truth than all my careful, measured ways.",
    "stanza5": "So let me count the ways I've been undone,\nBy tiny hands that reach to hold my face.\nThe calculations fail, but I have won\nA prize beyond all measure and all grace.",
    "stanza6": "For in this most irrational of roles,\nI've found the truest logic of the soul."
  }
]

