{
  "currentInterests": [
    {
      "title": "Applied AI Systems",
      "description": "Developing autonomous AI systems that can reason, plan, and interact with the world in useful ways.",
      "focus": "Multi-agent architectures, goal-oriented planning, and effective AI integration with existing systems.",
      "timeframe": "2023-Present"
    },
    {
      "title": "Complex Systems Theory",
      "description": "Studying emergent behaviors in complex adaptive systems with applications to social networks and technological systems.",
      "focus": "Network resilience, phase transitions, and computational modeling of complex systems.",
      "timeframe": "2022-Present"
    },
    {
      "title": "Cognitive Enhancement Technologies",
      "description": "Investigating tools and technologies that can augment human cognitive capacities.",
      "focus": "Human-computer interfaces, knowledge systems, and cognitive load optimization.",
      "timeframe": "2021-Present"
    },
    {
      "title": "Information Theory and Compression",
      "description": "Exploring the fundamental limits of information processing and representation.",
      "focus": "Kolmogorov complexity applications, data compression, and information-theoretic approaches to intelligence.",
      "timeframe": "2020-Present"
    }
  ],
  "slatedInterests": [
    {
      "title": "Quantum Computing Applications",
      "description": "Theoretical exploration of practical applications for near-term quantum computers.",
      "expectedStart": "Q3 2025",
      "readiness": 60
    },
    {
      "title": "Neurosymbolic AI",
      "description": "Combining neural networks with symbolic reasoning for more robust and interpretable AI systems.",
      "expectedStart": "Q1 2026",
      "readiness": 45
    },
    {
      "title": "Biological Computing",
      "description": "Investigating computation using biological substrates and systems.",
      "expectedStart": "Q4 2026",
      "readiness": 25
    },
    {
      "title": "Extended Cognition",
      "description": "Philosophical and practical exploration of extended mind theory and its implications.",
      "expectedStart": "Q2 2025",
      "readiness": 80
    }
  ]
}
