{
  "bounties": [
    {
      "id": 1,
      "title": "The Cognitive Foundations of Language Acquisition",
      "author": "Elizabeth R. Spelke",
      "type": "paper",
      "description": "A seminal paper on language acquisition in children published in a cognitive science journal around 1995-1998.",
      "details": "Volume 31, Issue 3, pages 397-411",
      "status": "open",
      "notes": "This paper is frequently cited but not available in any digital repository I can access."
    },
    {
      "id": 2,
      "title": "Quantum Computing: Theory and Application",
      "author": "Michael J. Biercuk & Richard Fontaine",
      "type": "book",
      "description": "First edition (2018) of this comprehensive textbook on quantum computing fundamentals.",
      "details": "ISBN: 978-3-319-96424-9",
      "status": "open",
      "notes": "Looking specifically for the first edition which contains several chapters not included in later editions."
    },
    {
      "id": 3,
      "title": "Neural Networks for Natural Language Processing: A Comprehensive Approach",
      "author": "Yoshua Bengio",
      "type": "book",
      "description": "A detailed guide to implementing neural networks for NLP tasks.",
      "details": "Published by MIT Press, 2016, ISBN: 978-0-262-03384-8",
      "status": "claimed",
      "notes": "This book is out of print and not available in digital form through official channels."
    },
    {
      "id": 4,
      "title": "Emergent Phenomena in Complex Adaptive Systems",
      "author": "Stuart Kauffman & John Holland",
      "type": "paper",
      "description": "A collaborative paper on emergent behaviors in complex systems.",
      "details": "Published in Journal of Complex Systems, Vol. 12, 2007",
      "status": "open",
      "notes": "This journal ceased publication in 2009 and back issues are difficult to obtain."
    },
    {
      "id": 5,
      "title": "The Anthropology of Consciousness: Ritual and Belief Systems",
      "author": "Roy Rappaport",
      "type": "book",
      "description": "An anthropological study of consciousness and ritual across cultures.",
      "details": "Oxford University Press, 1999, ISBN: 978-0-19-512213-7",
      "status": "open",
      "notes": "This book is frequently cited but extremely difficult to find in digital form."
    },
    {
      "id": 6,
      "title": "Lectures on Advanced Cryptographic Protocols",
      "author": "Silvio Micali",
      "type": "video",
      "description": "A series of lectures given at MIT in 2001 on zero-knowledge proofs and other advanced cryptographic concepts.",
      "details": "5-part lecture series, approximately 8 hours total",
      "status": "open",
      "notes": "These lectures were recorded but never officially published. Some attendees claim to have personal copies."
    },
    {
      "id": 7,
      "title": "Computational Models of Consciousness",
      "author": "David Chalmers",
      "type": "paper",
      "description": "A theoretical framework for modeling consciousness computationally.",
      "details": "Published in Journal of Consciousness Studies, Special Issue, 2008",
      "status": "open",
      "notes": "This special issue is not included in most digital archives of the journal."
    },
    {
      "id": 8,
      "title": "The Evolution of Cooperation in Multi-agent Systems",
      "author": "Robert Axelrod & Michael D. Cohen",
      "type": "article",
      "description": "An extension of Axelrod's work on cooperation to complex multi-agent systems.",
      "details": "Published in Complexity, Vol. 4, Issue 2, 1999",
      "status": "claimed",
      "notes": "This article predates most digital archives of the journal."
    },
    {
      "id": 9,
      "title": "Theoretical Foundations of Quantum Field Theory in Curved Spacetime",
      "author": "Stephen Hawking & Gary Gibbons",
      "type": "book",
      "description": "A comprehensive treatment of quantum field theory in curved spacetime.",
      "details": "Cambridge University Press, 1993, ISBN: 978-0-521-43259-1",
      "status": "open",
      "notes": "This book was published before digital editions were common and has never been digitized officially."
    },
    {
      "id": 10,
      "title": "The Cognitive Neuroscience of Music Perception",
      "author": "Robert Zatorre",
      "type": "paper",
      "description": "A study on how the brain processes and perceives musical structures.",
      "details": "Published in Annals of the New York Academy of Sciences, Vol. 930, 2001",
      "status": "open",
      "notes": "This paper is frequently cited but not available in most digital repositories."
    },
    {
      "id": 11,
      "title": "Philosophical Investigations into the Nature of Mathematical Truth",
      "author": "Kurt Gödel",
      "type": "article",
      "description": "A lesser-known article by Gödel on the philosophy of mathematics.",
      "details": "Published in Journal of Symbolic Logic, Vol. 21, 1956",
      "status": "open",
      "notes": "This article is mentioned in several bibliographies but is extremely difficult to locate."
    },
    {
      "id": 12,
      "title": "Ethnographic Studies of Traditional Knowledge Systems in Papua New Guinea",
      "author": "Margaret Mead & Gregory Bateson",
      "type": "book",
      "description": "A collection of ethnographic studies conducted in Papua New Guinea.",
      "details": "Published by American Museum of Natural History, 1962",
      "status": "open",
      "notes": "This book contains unique ethnographic data not published elsewhere."
    }
  ]
}
