[
  {
    "rule": 0,
    "text": "Don't fuck with cats.",
    "explanation": "Riffing on humans is okay because a human knows what they're getting into when they log on. Abusing animals for clout, on the other hand, will get you in a lot of trouble."
  },
  {
    "rule": 1,
    "text": "You don't talk about /b/.",
    "explanation": "There are some places you have to be part of to really appreciate. /b/ is one of them."
  },  {
    "rule": 2,
    "text": "You DON'T talk about /b/.",
    "explanation": "A tongue‑in‑cheek echo of Fight Club—the first two rules forbid any mention of /b/ outside /b/, reinforcing the board's mystique and protecting raids from outside scrutiny."
  },
  {
    "rule": 3,
    "text": "We are Anonymous.",
    "explanation": "On the internet everyone is anonymous. It's part of being on the internet! Thus I'm anonymous, you're anonymous..."
  },
  {
    "rule": 4,
    "text": "We are legion.",
    "explanation": "It sounds threatening, but in actuality it refers to the \"many stones make a mountain\" principle; if we each do our part, we can make a larger impact than you can imagine!"
  },
  {
    "rule": 5,
    "text": "We do not forgive, we do not forget.",
    "explanation": "Originally, this meant \"the internet is forever. nothing is ever really deleted so don't be stupid unless you want to be remembered as stupid.\" But hacktivists hijacked it, turning it into a meme."
  },
  {
    "rule": 6,
    "text": "Anonymous can be a horrible, senseless, uncaring monster.",
    "explanation": "Once again, remember G.I.F.T., but more so, the dreaded Internet troll — someone who deliberately sabotages a forum with anger-inducing comments just to watch its occupants go ballistic, and/or derail a whole discussion."
  },
  {
    "rule": 7,
    "text": "Anonymous is still able to deliver.",
    "explanation": "\"Deliver\" means to do what you promised you would. This means that if we all pitch in we can do amazing things together! Sometimes all it takes is one person doing something right to make a difference."
  },
  {
    "rule": 8,
    "text": "There are no real rules about posting.",
    "explanation": "Site rules vary and nobody can force you to post or not post anything."
  },
  {
    "rule": 9,
    "text": "There are no real rules about moderation either — enjoy your ban.",
    "explanation": "Caveat to rule 8: If you act stupid or break the site rules, remember that the ban hammer is always stronger than you."
  },
  {
    "rule": 10,
    "text": "/b/ is not your personal army.",
    "explanation": "People tend to go on 4Chan, especially /b/, expecting others to solve their problems or get back at their personal \"enemies\" for them. The posters of 4Chan have better things to do with their time than dealing with petty things the person posting really should be dealing with on their own."
  },  {
    "rule": 11,
    "text": "No matter how much you love debating, keep in mind that no one on the internet debates. Instead they mock your intelligence as well as your parents.",
    "explanation": "On anonymous boards, logical debate is pointless; posters routinely derail arguments by ignoring points and mocking each other's intelligence, so \"winning\" a debate is impossible."
  },
  {
    "rule": 12,
    "text": "Anything you say can and will be used against you.",
    "explanation": "Remember: the internet is forever. All it takes is one person with an incriminating copy."
  },
  {
    "rule": 13,
    "text": "Anything you say can and will be turned into something else.",
    "explanation": "Also remember the G.I.F.T. which can be compounded with the other rules."
  },
  {
    "rule": 14,
    "text": "Do not argue with trolls—it means they win.",
    "explanation": "Trolls are not interested in genuine debate; they just want attention and will never argue in good faith. The only way to defeat a troll is to ignore them, thus denying them attention and any entertainment they can get from provoking angry responses out of you."
  },
  {
    "rule": 15,
    "text": "The harder you try, the harder you will fail.",
    "explanation": "Which is more amazing: failing at making a LEGO elephant or failing at making a elephant-shaped house?"
  },  {
    "rule": 16,
    "text": "If you fail in epic proportions, it may just become a winning failure.",
    "explanation": "A blunder so spectacular can be re‑memed into a \"win\"; epic failure often becomes celebrated content precisely because of how badly it went."
  },
  {
    "rule": 17,
    "text": "Every win fails eventually.",
    "explanation": "Statistics have not exactly proven the statement \"nothing lasts forever\" wrong. Enjoy your successes but don't dwell on them."
  },
  {
    "rule": 18,
    "text": "Everything that can be labelled can be hated.",
    "explanation": "No matter what you love there's bound to be someone who doesn't love it. Labels also create judgment. Learn to live and let live."
  },
  {
    "rule": 19,
    "text": "The more you hate it, the stronger it gets.",
    "explanation": "Hate is pointless. Don't waste your time on it."
  },  {
    "rule": 20,
    "text": "Nothing is to be taken seriously.",
    "explanation": "/b/ treats everything as a joke; if you take anything too seriously you've already lost the spirit of the place."
  },
  {
    "rule": 21,
    "text": "Original content is original only for a few seconds before it's no longer original.",
    "explanation": "This is because people tend to save and repost things they like. Some even think every idea is a mutation of another idea: in short original content doesn't exist."
  },
  {
    "rule": 22,
    "text": "Copypasta is made to ruin every last bit of originality.",
    "explanation": "This is because people tend to save and repost things they like. Some even think every idea is a mutation of another idea: in short original content doesn't exist."
  },
  {
    "rule": 23,
    "text": "Copypasta is made to ruin every last bit of originality.",
    "explanation": "This is because people tend to save and repost things they like. Some even think every idea is a mutation of another idea: in short original content doesn't exist."
  },
  {
    "rule": 24,
    "text": "Every post is always a repost of a repost.",
    "explanation": "This is because people tend to save and repost things they like. Some even think every idea is a mutation of another idea: in short original content doesn't exist."
  },
  {
    "rule": 25,
    "text": "Relation to the original topic decreases with every single post.",
    "explanation": "People would add or subtract content from the original post as the conversation carries on, to the point where the discussion deviates widely from the original post."
  },
  {
    "rule": 26,
    "text": "Any topic can be easily turned into something totally unrelated.",
    "explanation": "As per rules 13 and 25, this can easily be the result of any conversation."
  },  {
    "rule": 27,
    "text": "Always question a person's sexual preferences without any real reason.",
    "explanation": "Trolling tactic—randomly question someone's sexuality to derail threads and provoke reactions, not to seek truth."
  },  {
    "rule": 28,
    "text": "Always question a person's gender - just in case it's really a man.",
    "explanation": "Likewise, always doubt a poster's stated gender; anonymity means anyone could be anyone, so gender claims become fodder for baiting."
  },
  {
    "rule": 29,
    "text": "On the internet men are men, women are also men, and kids are undercover FBI agents.",
    "explanation": "Remember: we are all anonymous which makes gender a moot point. The few people who point out their genders in an anonymous setting usually have ulterior motives."
  },
  {
    "rule": 30,
    "text": "Girls do not exist on the internet.",
    "explanation": "Due to being anonymous and gender being a moot point, saying you are a \"girl\" usually denotes the poster is not a girl and just saying this to get attention, or really is a girl but is still just trying to get attention. Either way, trying to get everyone's attention is a trolling tactic. Ignore them. Girl? What girl? We're all anons!"
  },
  {
    "rule": 31,
    "text": "Tits or GTFO—the choice is yours.",
    "explanation": "Any anon claiming to be a girl has to post a picture of her breasts in order to prove that she's telling the truth. If she refuses, she's considered a liar and has to leave."
  },  {
    "rule": 32,
    "text": "You must have pictures to prove your statements/Anything can be explained with a picture.",
    "explanation": "\"Pics or it didn't happen.\" Extraordinary (or even ordinary) claims need photographic proof; otherwise the board dismisses them."
  },
  {
    "rule": 33,
    "text": "Lurk more—it's never enough.",
    "explanation": "When in doubt, don't post: read. Chances are your answer is already somewhere. It also prevents you from ruining \"good things\" and looking really dumb. Think you know enough to post? That means you probably don't."
  },  {
    "rule": 34,
    "text": "If it exists, there is porn of it. No exceptions.",
    "explanation": "If a concept exists, someone has already created porn featuring it—no exceptions."
  },  {
    "rule": 35,
    "text": "If there is no porn of it, porn will be made of it.",
    "explanation": "Corollary to 34—if the porn doesn't exist yet, the internet will eventually make it."
  },  {
    "rule": 36,
    "text": "No matter how fucked up it is, there is always worse than what you just saw.",
    "explanation": "However shocking the content you just saw, something even more disturbing is only a click away; escalation is endless."
  },
  {
    "rule": 37,
    "text": "You cannot divide by zero (just because the calculator says so).",
    "explanation": "Nothing will never become something. You have to create things for others to be able to come enjoy them. Also don't try to wrangle the site rules to your favor—it won't work."
  },
  {
    "rule": 38,
    "text": "No real limits of any kind apply here—not even the sky.",
    "explanation": "The internet is all the world, both good and bad, in one place. What you make of it is up to you!"
  },
  {
    "rule": 39,
    "text": "CAPS LOCK IS CRUISE CONTROL FOR COOL.",
    "explanation": "A classic meme..."
  },
  {
    "rule": 40,
    "text": "EVEN WITH CRUISE CONTROL YOU STILL HAVE TO STEER",
    "explanation": "...but please note that it's very easy to overdo memes and look like an unfunny idiot in the process. Please use your internet wit (and caps lock as well) sparingly and with common sense."
  },
  {
    "rule": 41,
    "text": "Desu isn't funny. Seriously guys. It's worse than Chuck Norris jokes.",
    "explanation": "The more you post a meme, the less funny it gets. Also, some things never were very funny to start with even though people keep posting them. Posting something over and over doesn't make a meme. These sorts of things are called \"forced memes\"."
  },
  {
    "rule": 42,
    "text": "Nothing Is Sacred.",
    "explanation": "No matter what you hold dear, prepare for others who don't get it or don't care about it. Just as you would expect others to respect your liking something, please respect that others may not agree. Learn to let go, ignore, and move on. Also an anti-shout out to the \"meaning of life\" from The Hitchhiker's Guide."
  },  {
    "rule": 43,
    "text": "The more beautiful and pure a thing is—the more satisfying it is to corrupt it.",
    "explanation": "Trolling thrives on defilement; the purer or more innocent something is, the greater the satisfaction in corrupting or mocking it."
  },  {
    "rule": 44,
    "text": "If it exists, there is a version of it for your fandom... and it has a wiki and possibly a tabletop version with a theme song performed by a Vocaloid.",
    "explanation": "Fandoms reinterpret everything—they'll build wikis, tabletop games, Vocaloid theme songs, etc., for any subject that exists."
  },
  {
    "rule": 45,
    "text": "When one sees a lion, one must get in the car.",
    "explanation": "JESUS CHRIST IT'S A LION GET IN THE CAR! >:3"
  },
  {
    "rule": 46,
    "text": "The internet is SERIOUS FUCKING BUSINESS.",
    "explanation": "Remember the MST3K Mantra: \"It's really just a show, I should try to relax...\""
  },
  {
    "rule": 47,
    "text": "The pool is always closed.",
    "explanation": "Slang for when jerks ruin something good—\"Pool is closed\". It's a reference to a series of raids /b/ carried out on Habbo Hotel, where they would block the entrance of popular hangouts with their black avatars dressed in an afro and business suit; one of the phrases they repeatedly used in chat was \"Pool's closed due to AIDS\". The raids were in response to rumors that Habbo moderators had a tendency to ban users based on the color of their skin."
  },  {
    "rule": 48,
    "text": "The only good hentai is Yuri, that's how the internet works. Only exception may be Vanilla.",
    "explanation": "A facetious hentai \"review\": internet culture jokingly insists only yuri (and maybe plain vanilla) is worth watching."
  },  {
    "rule": 49,
    "text": "No matter what it is, it is somebody's fetish.",
    "explanation": "Every conceivable idea, object or scenario is someone's fetish somewhere online—no exceptions."
  },  {
    "rule": 50,
    "text": "A Crossover, no matter how improbable, will eventually happen in Fan Art, Fan Fiction, or official release material, often through fanfiction of it.",
    "explanation": "However improbable, crossovers will emerge in fan‑art or fan‑fiction; audiences eventually mash everything up."
  },  {
    "rule": 61,
    "text": "Chuck Norris is the exception, no exceptions.",
    "explanation": "Chuck Norris jokes override all other \"rules\"; the meme legend is the exception to every exception."
  },  {
    "rule": 62,
    "text": "It has been cracked and pirated. You can find anything if you look long enough.",
    "explanation": "If software or media exists, someone has already cracked or pirated it; persistence guarantees a free copy surfaces."
  },
  {    "rule": 63,
    "text": "For every given male character, there is a female version of that character (and vice-versa). And there is always porn of that character.",
    "explanation": "An extension of Rule 34, this rule specifically addresses gender-swapped versions of characters in fan art and pornographic content. It acknowledges the internet's tendency to create alternate versions of existing characters, particularly gender-bent interpretations, and that these variations will inevitably be sexualized."
  },
  {
    "rule": 64,
    "text": "If it exists, it has \"LOOOOORRRREE!\"",
    "explanation": "People on the internet love to interpret things as narratives and stories, so as an extension of Rule 13, if something exists, like a picture of a yellowed empty room, a picture of a peanut shaped sculpture, or the alphabet, an entire history of legends, heroes, villains and entire universes will come into existence around that thing."
  },
  {    "rule": 65,
    "text": "If it doesn't, there will be.",
    "explanation": "Corollary to Rule 64 - if something exists without elaborate backstory or lore, the internet community will eventually create it. This reflects the internet's compulsive need to expand and mythologize even the simplest concepts into complex universes."
  },
  {    "rule": 66,
    "text": "The longer the LORE around something is, the weirder it gets.",
    "explanation": "As internet communities expand fictional universes around concepts, the lore becomes increasingly bizarre and convoluted. What starts as simple fan theories evolves into incomprehensibly complex mythologies filled with strange characters, impossible physics, and absurd plot developments."
  },
  {    "rule": 67,
    "text": "If it has lore, it also has lore from alternate timelines, especially if the main lore is copyrighted by a big power hungry corporation.",
    "explanation": "Popular fictional universes spawn infinite alternate timeline interpretations, particularly when fans want to escape corporate control of beloved franchises. This creates parallel lore universes where fans can explore 'what if' scenarios without copyright restrictions."
  },
  {    "rule": "67/2",
    "text": "90% of fanfiction is the stuff of nightmares.",
    "explanation": "Most fanfiction explores disturbing, inappropriate, or poorly written scenarios that would horrify the original creators and most readers. While 10% might be genuinely good, the vast majority consists of bizarre pairings, explicit content, and amateur writing that's unintentionally disturbing."
  },
  {    "rule": 68,
    "text": "Everything has a fandom, everything.",
    "explanation": "No matter how obscure, mundane, or unlikely a subject seems, there exists a dedicated community of fans who are passionate about it. From household appliances to abstract concepts, the internet will form fandoms around literally anything."
  },
  {    "rule": 69,
    "text": "Nice!",
    "explanation": "The automatic response to seeing the number 69 anywhere on the internet. This juvenile humor reaction is so ingrained in internet culture that it appears instantly and universally whenever the number is mentioned, regardless of context."
  },
  {    "rule": 70,
    "text": "Do not talk about the 100M GET failure.",
    "explanation": "References a significant failure in 4chan's 'GET' culture, where users compete to post at milestone post numbers. The 100 millionth post was apparently claimed incorrectly or controversially, becoming a forbidden topic of discussion on the boards."
  },
  {    "rule": 72,
    "text": "If a song exists, there's a Megalovania version of it.",
    "explanation": "Megalovania, the iconic boss theme from Undertale, has been remixed and adapted to countless other songs and contexts. This rule acknowledges the internet's obsession with creating Megalovania versions of virtually every piece of music in existence."
  },
  {    "rule": 77,
    "text": "The Internet makes you stupid.",
    "explanation": "Prolonged internet use can lead to shortened attention spans, reduced critical thinking, information overload, and the tendency to accept misinformation. The constant stream of memes, arguments, and low-quality content can degrade intellectual capacity over time."
  },
  {    "rule": 78,
    "text": "If something is popular, there's brainrot of it",
    "explanation": "Popular content inevitably spawns low-quality, repetitive, or mind-numbing derivative content designed to capitalize on trends. This 'brainrot' content floods platforms with thoughtless variations that can diminish the original's quality and meaning."
  },
  {    "rule": 79,
    "text": "If something is popular, and there's no brainrot of it, it's coming soon",
    "explanation": "Corollary to Rule 78 - if popular content hasn't yet been corrupted by low-quality derivatives, it's only a matter of time. The internet's content machine will inevitably produce mindless variations of any trending topic."
  },
  {    "rule": 80,
    "text": "Gore is always present on the internet.",
    "explanation": "No matter how innocent or family-friendly a platform claims to be, disturbing violent content will eventually appear. The internet's vast, largely unmoderated spaces ensure that graphic content is never more than a few clicks away from any user."
  },
  {    "rule": 86,
    "text": "If something has two colors, it can play \"Bad Apple!\"",
    "explanation": "Bad Apple!!, a black and white music video from the Touhou series, has been recreated using virtually every medium that can display two contrasting states. From calculators to Minecraft, if something can show two different colors or states, someone has made it play Bad Apple."
  }
]
